In [2]:
import  pandas as pd

In [3]:
dataset = pd.read_csv('Social_Network_Ads.csv')

In [4]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [5]:
dataset = pd.get_dummies(dataset,drop_first = True)

In [7]:
dataset=dataset.drop('User ID',axis=1)

In [8]:
dataset

     Age  EstimatedSalary  Purchased  Gender_Male
0     19            19000          0            1
1     35            20000          0            1
2     26            43000          0            0
3     27            57000          0            0
4     19            76000          0            1
..   ...              ...        ...          ...
395   46            41000          1            0
396   51            23000          1            1
397   50            20000          1            0
398   36            33000          0            1
399   49            36000          1            0

[400 rows x 4 columns]

In [9]:
dataset['Purchased'].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [10]:
indep = dataset[['Age','EstimatedSalary','Gender_Male']]
dep= dataset[['Purchased']]

In [13]:
from sklearn.model_selection import train_test_split
X_train,x_test,y_train,y_test = train_test_split(indep,dep,random_state=0,test_size=1/3)

In [15]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier()

In [16]:
classifier.fit(X_train,y_train)

C:\Users\rajes\AppData\Local\Temp\ipykernel_30540\500067374.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  classifier.fit(X_train,y_train)

RandomForestClassifier()

In [17]:
y_pred = classifier.predict(x_test)

In [18]:
from sklearn.metrics import confusion_matrix
cm= confusion_matrix(y_test,y_pred)

In [22]:
print(cm)

[[77  8]
 [ 4 45]]

In [19]:
from sklearn.metrics import classification_report
clf_report = classification_report(y_test,y_pred)

In [21]:
print(clf_report)

              precision    recall  f1-score   support

           0       0.95      0.91      0.93        85
           1       0.85      0.92      0.88        49

    accuracy                           0.91       134
   macro avg       0.90      0.91      0.91       134
weighted avg       0.91      0.91      0.91       134